{
    "title": {
        "media": {
            "url": "https://drive.google.com/file/d/1PWZDr9W-JCA58oaflI4iPMYNjDwqhS2i/view?usp=sharing"
        },
        "text": {
            "headline": "Welcome to Li Wen's Timeline!!"
        }
    },
    "events": [
      {
        "media": {
          "url": "https://drive.google.com/file/d/1VbHfzQOsHJhi7iwQJqEKysu5eiucr9Qk/view?usp=sharing",
          "caption": "My certificate when I went for ApLM at Singapore Poly"
        },
        "start_date": {
          "year": "2024",
          "month":"3",
          "day": "11"
        },
        "text": {
          "headline": "ApLM@SP",
          "text": "I went for ApLM when I was Sec 3 on Gene Explorer which is Applied Science. I am also interested in Biology so this ApLM was able to let me learn a bit more about it which expanded my knowledge"
        }
      },
      {
        "media": {
          "url": "https://drive.google.com/file/d/1P4f0fKzPbA5dnxsByjytzet_3fctlLhm/view?usp=sharing",
          "caption": "This photo is the prize award ceremony award when I won 2nd for the Design Innovation Challenge",
          "credit": "https://www.sgs.moe.edu.sg/students-academic-achievements/"
        },
        "start_date": {
          "year": "2024",
          "month":"5",
          "day":"21"
        },
        "text": {
          "headline": "Design Innovation Challenge",
          "text": "This was when I coded my first project which is the Fitness App for this challenge and won 2nd Place with my teammates. It was so memorable as I seen many other projects that felt like is better then ours. But we came out as 2nd Place, my teammates and I were so shocked to see the results and tears of joy came out from our eyes."
        }
      },
      {
        "media": {
          "url": "https://drive.google.com/file/d/1OkjPbXrnlmNwzJxNc9B2XXZt2-0cWjTn/view?usp=sharing",
          "caption": "Me controlling the drone for air surveying"
        },
        "start_date": {
          "year": "2024",
          "month":"11",
          "day": "7"
        },
        "text": {
          "headline": "First time controlling the drone to do aerial surveying",
          "text": "On that day, my schoolmates that was in the same work shadowing programme as me flew the drone to do aerial surveying, we learnt what technology is behind aerial surveying."
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1OnKQ_9bFk43REu0L7Q13OdUAD1yNSOPl/view?usp=sharing",
            "caption": "Using the drone to take a Group Photo"
        },
        "start_date":{
            "year": "2024",
            "month":"11",
            "day":"7"
        },
        "text":{
            "headline": "WSP Group Photo taken with a drone",
            "text": "After learning about the drone and using the drone outside at a flying zone to do the aerial surveying, before we ended we took a photo using the drone to end this part and going back to the office to learn more things like creating maps"
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1IWWtFAoQJFCQzVKWRHrjuxBVyglSHQd7/view?usp=sharing",
            "caption": "Group Photo after VIA"
        },
        "start_date":{
            "year":"2024",
            "month": "8",
            "day": "16"
        },
        "text":{
            "headline":"VIA 2024",
            "text": "After the VIA, we took a group photo with the seniors products produly shown to the camera to remember this VIA project and what we did together. The CCA members and the seniors made a phone stand that can put plants! It was a pretty fun day getting to know the seniors and teaching the seniors how to make that as well. Talking with a different generation then me allow me to learn something new about their generation"
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1-JsBAkM--uwjUWKSjdzqptXqeIVM0DGZ/view?usp=sharing",
            "caption": "Me doing the briefing to the seniors about the project"
        },
        "start_date":{
            "year":"2024",
            "month":"8",
            "day":"23"
        },
        "text":{
            "headline":"VIA 2024",
            "text": "This is a photo of me doing the breifing for the phone stand VIA project to the seniors, to let the seniors know what to expect and what to do later when they are going to make the phone stand with the students assistant. This is the 2nd session of our VIA"
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1Op0P2SjZ7MaWClJjqkMWihrT1eMLzltN/view?usp=sharing",
            "caption": "Me typing information in my teammates laptop"
        },
        "start_date": {
            "year":"2025",
            "month":"4",
            "day":"5"
        },
        "text":{
            "headline":"YCEP 2025",
            "text": "This is a photo of me at YCEP when competiting for the Group Category, it was my first time competiting in a group category for CTF, I really did not know what to expect. Luckily my teammates guided me on what I should do and help on the documents with my knowledge"
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1P1MwUFXhgkD5XMOUFkUjQ6ku8QitTYls/view?usp=sharing",
            "caption": "A photo of me during the break of YCEP"
        },
        "start_date": {
            "year": "2025",
            "month":"4",
            "day":"5"
        },
        "text":{
            "headline":"YCEP 2025",
            "text": "This is a photo of me talking to my friend when I met her at the YCEP Bootcamp. This was during the break and I saw her at her seat, since the individual category CTF has ended. So I went up to her and shared my experience since she missed that part, and the person beside also joined into the conversation sharing his point of view. That experience was special as I really dont get the opportunity to share stuff related to CTF with others. That was one of my only chances"
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1Ogg6Y0hIRuq5gy-lgtUhtX2MRjjtDKGg/view?usp=sharing",
            "caption": "A certificate on WSP"
        },
        "start_date":{
            "year" : "2024",
            "month" : "11",
            "day" : "8"
        },
        "text": {
            "headline": "WSP 2024",
            "text": "After the WSP at Singapore Institute of Surveyors and Valuers ended for me, I got a certificate! My time in Singapore Institute of Surveyors and Valuers was unique as it was my first time learning about this occupation. Being able to experience land, aerial and marine surveying was really amazing. Who knew I would be able to experience all these :D"
        }
      },
      {
        "media":{
            "url": "https://drive.google.com/file/d/16xudzfJnTnl1d3SFlPEa-2RIoG_cGlyF/view?usp=sharing",
            "caption": "YBN CTF certificate"
        },
        "start_date": {
            "year": "2024",
            "month": "11",
            "day": "30"
        },
        "text": {
            "headline": "My first ever CTF!",
            "text": "This is when I played in my first ever CTF! It was by Yes But No. After that I fell in love with playing CTF and joined when I get the chance to. I love playing in Crypto and Web Category, however I only know the basics of it and hope that I can improve further"
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1PS2k3e96WXhocUhFa0VdOEDbmIBlNmOO/view?usp=sharing",
            "caption":"BuildingBloCS Hackathon Certificate"
        },
        "start_date": {
            "year": "2024",
            "month":"3",
            "day": "13"
        },
        "text": {
            "headline": "My first ever Hackthon!",
            "text":"This is when I competed in my first ever Hackathon! It was by BuildingBloCS, I had to go for a conference to learn things that would be necessary in this Hackathon which is learning NumPy, matplotlib and seaborn and using them in the Hackathon Project. In the end, we got 1st place by showing the data on the topic what makes singaporeans feel like they are sinagporeans. This hackathon also let me wanted to participate in more hackathon to see what I can code out to contribute to the society"
        }
      },
      {
        "media": {
            "url": "https://drive.google.com/file/d/1PVV_1SthWumUHkZRvyVtQSfhHaxCDayd/view?usp=sharing",
            "caption": "Me winning and Academic Award",
            "credit": "@official.sgss"
        },
        "start_date": {
            "year": "2024",
            "month": "10",
            "day": "28"
        },
        "text": {
            "headline": "Top in Computing!",
            "text": "This is when I got Top in Computing in Sec 3. It felt like a dream as I did not expect myself to get Top in Computing but I mean, at least my hardwork paid off right? (if you would like to see the cert, it is in the achievements page)"
        }
      }
    ]
}